# How to convert Series to DataFrame?

In [3]:
import numpy as np
import pandas as pd

In [ ]:
The syntax is Series.to_frame(name=None)

In [3]:
# Let’s convert a pandas series s into a data frame and set the column name to 'Age':

## convert a list to pandas Series -->  pd.Series([....], name='......')

In [4]:
s = pd.Series([25, 18, 40], name="vals")

s

0    25
1    18
2    40
Name: vals, dtype: int64

##  convert to pandas frame-->  .to_frame(name='.....')

In [6]:
df = s.to_frame(name="Age")

print(df)
print(type(df))

   Age
0   25
1   18
2   40
<class 'pandas.core.frame.DataFrame'>

## create a DataFrame --> pd.DataFrame(...)

In [5]:
df = pd.DataFrame(s)
df

   vals
0    25
1    18
2    40

 # Convert Multiple Series to Pandas DataFrame

In [ ]:
# Now you’ll observe how to convert multiple Series (for the following data) into a DataFrame.
# Let’s now create the 3 Series based on the above data:

In [11]:
first_name = ['Jon','Mark','Maria','Jill','Jack']
series_first_name = pd.Series(first_name)

print (series_first_name)

last_name = ['Anderson','Smith','Green','Miller','Carter']
series_last_name = pd.Series(last_name)

print(series_last_name)

age = [23,57,42,35,29]

series_age = pd.Series(age)
print(series_age)

0      Jon
1     Mark
2    Maria
3     Jill
4     Jack
dtype: object
0    Anderson
1       Smith
2       Green
3      Miller
4      Carter
dtype: object
0    23
1    57
2    42
3    35
4    29
dtype: int64

In [13]:
df_first_name = pd.DataFrame(series_first_name)
df_first_name = df_first_name.rename(columns = {0:'First Name'})

df_last_name = pd.DataFrame(series_last_name)
df_last_name = df_last_name.rename(columns = {0:'Last Name'})

df_age = pd.DataFrame(series_age)
df_age = df_age.rename(columns = {0:'Age'})

df_all = pd.concat([df_first_name, df_last_name, df_age], axis=1)
print(df_all)
print(type(df_all))

  First Name Last Name  Age
0        Jon  Anderson   23
1       Mark     Smith   57
2      Maria     Green   42
3       Jill    Miller   35
4       Jack    Carter   29
<class 'pandas.core.frame.DataFrame'>

## create a DataFrame from a dictionary

In [14]:
author = ['Jitender', 'Purnima', 'Arpit', 'Jyoti']
article = [210, 211, 114, 178]

In [15]:
auth_series = pd.Series(author)
article_series = pd.Series(article)

In [16]:
frame = { 'Author': auth_series, 'Article': article_series }
  
# the dictionary's keys will be the column names of DataFrame

In [18]:
result = pd.DataFrame(frame)

result

     Author  Article
0  Jitender      210
1   Purnima      211
2     Arpit      114
3     Jyoti      178

In [20]:
# adding a Series

age = [21, 21, 24, 23]


# we assign pd.Series(age) to index named Age of the result dataframe 
result['Age'] = pd.Series(age)
  
result

     Author  Article  Age
0  Jitender      210   21
1   Purnima      211   21
2     Arpit      114   24
3     Jyoti      178   23

# How to convert string to date?

In [21]:
import datetime
datetime.datetime.strptime('24052010', "%d%m%Y").date()
datetime.date(2010, 5, 24)

datetime.date(2010, 5, 24)

In [38]:
from datetime import datetime
date_object = datetime.strptime('Jul 1 2014 2:43PM', '%b %d %Y %I:%M%p')
print(date_object)

2014-07-01 14:43:00

In [22]:
t = '27 Mayıs 2014'

In [25]:
t.split()

['27', 'Mayıs', '2014']

In [23]:
gün, ay, yıl = t.split()

In [24]:
print('gün:', gün, 'ay:', ay, 'yıl:', yıl)

gün: 27 ay: Mayıs yıl: 2014

In [26]:
t = '27 Mayıs 2014 saat 12:34:44:'

In [27]:
t.split()

['27', 'Mayıs', '2014', 'saat', '12:34:44:']

In [36]:
gün, ay, yıl, saat = [i for i in t.split() if 'saat' not in i]

In [31]:
gün

'27'

In [32]:
ay

'Mayıs'

In [33]:
yıl

'2014'

In [37]:
saat

'12:34:44:'

In [38]:
t = '27 Mayıs 2014 saat 12:34:44'

In [39]:
z = datetime.datetime.strptime(t, '%d %B %Y saat %H:%M:%S')

ValueError: time data '27 Mayıs 2014 saat 12:34:44' does not match format '%d %B %Y saat %H:%M:%S'